# 创建
s = set([1, 1, 2, 2, 3, 3])
l=list(s)
print(s)  #{1, 2, 3}
print(l)  #[1, 2, 3] 相当于对数组去重了

#增
print("*************增************")
s.add(4)
print(s)  #{1, 2, 3, 4}

#删除
print("*************删************")
s.remove(4)
print(s)  #{1, 2, 3}


#取交集和并集
print("*************交集和并集************")
s1 = set([1, 2, 3])
s2 = set([2, 3, 4])
print(s1 & s2)  #{2, 3}
print(s1 | s2)  #{1, 2, 3, 4}



#对tuple进行处理
print("*************对tuple进行处理************")
s=set((1, 2, 3))  #{1,2,3}
print(s)
# set((1, [2, 3]))
